{"class_name": "Model", "keras_version": "2.2.4", "config": {"name": "model_2", "layers": [{"inbound_nodes": [], "name": "input_10", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "name": "input_10", "dtype": "int32", "sparse": false}}, {"inbound_nodes": [], "name": "input_9", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "name": "input_9", "dtype": "int32", "sparse": false}}, {"inbound_nodes": [[["input_9", 0, 0, {}]], [["input_10", 0, 0, {}]]], "name": "embedding_3", "class_name": "Embedding", "config": {"embeddings_constraint": null, "dtype": "float32", "input_dim": 15000, "output_dim": 50, "trainable": true, "name": "embedding_3", "embeddings_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "batch_input_shape": [null, null], "mask_zero": false, "input_length": null, "activity_regularizer": null}}, {"inbound_nodes": [[["embedding_3", 0, 0, {}]]], "name": "lstm_11", "class_name": "LSTM", "config": {"bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_state": true, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "return_sequences": false, "name": "lstm_11", "recurrent_regularizer": null, "unit_forget_bias": true, "activation": "tanh", "trainable": true, "recurrent_dropout": 0.0, "dropout": 0.0, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "recurrent_constraint": null, "units": 300, "stateful": false, "kernel_regularizer": null, "unroll": false, "implementation": 1, "kernel_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["embedding_3", 1, 0, {}], ["lstm_11", 0, 1, {}], ["lstm_11", 0, 2, {}]]], "name": "lstm_12", "class_name": "LSTM", "config": {"bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_state": true, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "name": "lstm_12", "recurrent_regularizer": null, "unit_forget_bias": true, "activation": "tanh", "trainable": true, "recurrent_dropout": 0.0, "dropout": 0.0, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "recurrent_constraint": null, "units": 300, "stateful": false, "kernel_regularizer": null, "unroll": false, "implementation": 1, "kernel_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["lstm_12", 0, 0, {}]]], "name": "time_distributed_4", "class_name": "TimeDistributed", "config": {"trainable": true, "name": "time_distributed_4", "layer": {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "dense_6", "bias_constraint": null, "units": 15000, "kernel_regularizer": null, "trainable": true, "activation": "softmax", "kernel_constraint": null, "activity_regularizer": null}}}}], "input_layers": [["input_9", 0, 0], ["input_10", 0, 0]], "output_layers": [["time_distributed_4", 0, 0]]}, "backend": "tensorflow"}